app/controllers/api/transactions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."api_key" = $1 LIMIT $2  [["api_key", "PqyVl-OOLwocWNSkodz9CA"], ["LIMIT", 1]]
INSERT INTO "transactions" ("transaction_type", "user_id", "coin_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["transaction_type", 1], ["user_id", 1], ["coin_id", 2], ["created_at", "2020-03-24 08:37:43.703319"], ["updated_at", "2020-03-24 08:37:43.703319"]]
SELECT  "coins".* FROM "coins" WHERE "coins"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "coins" SET "value" = $1, "updated_at" = $2 WHERE "coins"."id" = $3  [["value", 2], ["updated_at", "2020-03-24 08:37:43.736141"], ["id", 2]]
---
    def create
        @transaction = Transaction.new(transaction_params)

        # Assigns the correct user_id in case the user puts another user's ID

        @transaction.user_id = User.find_by(api_key: params[:api_key]).id

        if @transaction.save

            @coin = Coin.find(@transaction.coin_id)

            # If deposit, increment @coin's value, else decrement
            # Also, send email if value is less than 4

            if @transaction.transaction_type == 1
                @coin.update_attributes(value: @coin.value+1)