CoinMachine/app/models/user.rb

    def ensure_api_key
        self.api_key ||= SecureRandom.urlsafe_base64
        self.save!
---
INSERT INTO "users" ("email", "admin", "api_key", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "bob@mortgagehippo.com"], ["admin", true], ["api_key", "PqyVl-OOLwocWNSkodz9CA"], ["created_at", "2020-03-24 08:33:50.316880"], ["updated_at", "2020-03-24 08:33:50.316880"]]