app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."api_key" = $1 LIMIT $2  [["api_key", "PqyVl-OOLwocWNSkodz9CA"], ["LIMIT", 1]]
---
    def require_api_key
        @user = User.find_by(api_key: params[:api_key])